Autodesk.Revit.DB.View.CreateViewTemplate
Creates a new view template instance from this view instance.
Returns:
New view template instance
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The view is not valid for view template creation.
Since:
2020

Autodesk.Revit.DB.View.IsViewValidForTemplateCreation
Verifies that the view is valid for template creation.
Returns:
True if the view can be used for view template creation, false otherwise.
Since:
2020

Autodesk.Revit.DB.View.IsValidViewTemplate(Autodesk.Revit.DB.ElementId)
Verifies that the view represented by templateId can be set as the controlling view template for this view.
templateId:
The id to be validated as a view template for this view.
Returns:
True if the view is valid for us as a view template and compatible with this view, or if it is InvalidElementId, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.View.ApplyViewTemplateParameters(Autodesk.Revit.DB.View)
Applies to this view the parameters of the input view that are not controlled by the current view template.
Remarks:
Apply the view template parameters is a one-time operation, the association between the views is not preserved.
To get all template parameters call Autodesk.Revit.DB.View.GetTemplateParameterIds on the template.
To get parameters that are not controlled by the template call Autodesk.Revit.DB.View.GetNonControlledTemplateParameterIds on the template.
To get current view template of this view use property Autodesk.Revit.DB.View.ViewTemplateId.
otherView:
The view whose parameters are to be applied to this view.
It does not have to be a valid template (property IsTemplate can be true or false).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.View.SetNonControlledTemplateParameterIds(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Sets the parameters that will not be included when this view is used as a template.
Remarks:
This should be a subset of the parameters returned by Autodesk.Revit.DB.View.GetTemplateParameterIds (other parameters will be ignored).
newSet:
The parameter ids that should not be marked to be included.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.View.CanApplyColorFillScheme(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Checks if the id can be applied as the scheme id of specified category to this view.
Remarks:
The input scheme id could be InvalidElementId to clear the scheme for the specified category.
Some examples of returnning false:
The id is not a color fill scheme id.
The specified category is not supported by this view.
The category of scheme is not the same as the specified category.
The view is area plan but the scheme category is not OST_Areas,
or their Autodesk::Revit::DB::AreaScheme are not the same.
Etc.
categoryId:
The id of category.
schemeId:
The id of color fill scheme.
Returns:
True if the id can be applied as the scheme id of specified category in this view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.View.SupportedColorFillCategoryIds
Returns collection of all category ids that correspond to elements that can potentially be colored in this view
according to a color fill scheme. The set may be different depending on the view type.
Remarks:
All of the possible categories are OST_Rooms, OST_HVAC_Zones, OST_MEPSpaces, OST_Areas, OST_DuctCurves and OST_PipeCurves.
Since:
2022

Autodesk.Revit.DB.View.GetColorFillSchemeId(Autodesk.Revit.DB.ElementId)
Returns id of the color fill scheme element applied to the view.
categoryId:
The id of the category which the color fill scheme element belongs to.
Returns:
The id of the color fill scheme element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.View.SetColorFillSchemeId(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Applies color fill scheme to this view.
Remarks:
There could be at most three Autodesk::Revit::DB::ColorFillScheme applied in a view:
one for spatial elements (rooms, zones, spaces and areas), one for pipes and one for ducts.
Notes:
There's at most one scheme activated for all spatial categories.
For area plan view, the activated spatial scheme category must be OST_Areas and
has the same Autodesk::Revit::DB::AreaScheme  with this view if it is not used as a template.
To clear one of the above three schemes, use InvalidElementId as the parameter of this function.
To get list of element categories supportted to be colored in this view, use Autodesk.Revit.DB.View.SupportedColorFillCategoryIds.
To check whether an specified ElementId could be applied to this view, use Autodesk.Revit.DB.View.CanApplyColorFillScheme(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId).
categoryId:
The id of category to apply a color fill scheme element.
schemeId:
The id of the color fill scheme element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The schemeId can not be applied as the scheme id of categoryId in this view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.View.SetViewDisplayModel(Autodesk.Revit.DB.ViewDisplayModel)
Sets the view display model settings for the view.
viewDisplayModel:
View display model settings to set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The silhouette line style id is not a valid line style to apply to the view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This view does not contain display-related properties.
Since:
2015

Autodesk.Revit.DB.View.SetDepthCueing(Autodesk.Revit.DB.ViewDisplayDepthCueing)
Sets the depth cueing settings for the view.
depthCueing:
Depth cueing settings to set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This view does not contain display-related properties.
-or-
This view cannot use Depth Cueing
Since:
2017

Autodesk.Revit.DB.View.SetSketchyLines(Autodesk.Revit.DB.ViewDisplaySketchyLines)
Sets the sketchy lines settings for the view.
sketchyLines:
Sketchy Lines settings to set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This view does not contain display-related properties.
Since:
2015

Autodesk.Revit.DB.View.SetBackground(Autodesk.Revit.DB.ViewDisplayBackground)
Sets the background for the view.  Background can only be set for 3d views and for Sections/Elevations.
background:
Background to set.  See 'ViewDisplayBackground' class and its 'create' methods.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The background object is invalid, or view has 'Rendering' style.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This view does not contain display-related properties.
Since:
2014

Autodesk.Revit.DB.View.SetElementOverrides(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.OverrideGraphicSettings)
Sets graphic overrides for an element in the view.
elementId:
Element to override.
overrideGraphicSettings:
An object representing all graphic overrides of the element in view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
elementId is not a valid Element identifier.
-or-
Fill pattern must be a drafting pattern.
-or-
Fill pattern Id must be invalidElementId or point to a LinePattern element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element "this View" does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.GetElementOverrides(Autodesk.Revit.DB.ElementId)
Gets graphic overrides for an element in the view.
elementId:
The element.
Returns:
An object representing all graphic overrides of the element elementId in view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
elementId is not a valid Element identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element "this View" does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.IsFilterApplied(Autodesk.Revit.DB.ElementId)
Indicates if a filter is applied to the view.
filterElementId:
ElementId of the filter.
Returns:
True if the filter is applied to the view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
ElementId is not associated with a FilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element "this View" does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.SetIsFilterEnabled(Autodesk.Revit.DB.ElementId,System.Boolean)
Sets the filter enabled flag.
Remarks:
Several filters can be applied to a view in a sertain order. This enable/disable flag
allows one to quickly turn on/off the action of a particular filter in this view (without
removing the filter from the set of applied filters and loosing the corresponding overrides).
By default, all the filters applied to a view are enabled.
filterElementId:
The ElementId of the filter.
enable:
True if the specified filter should be enabled in this view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Filter is not applied to the view.
-or-
ElementId is not associated with a FilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element "this View" does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2021

Autodesk.Revit.DB.View.GetIsFilterEnabled(Autodesk.Revit.DB.ElementId)
Identifies if the filter is enabled in this view.
Remarks:
Several filters can be applied to a view in a certain order. This enable/disable flag
allows one to quickly turn on/off the action of a particular filter in this view (without
removing the filter from the set of applied filters and losing the corresponding overrides).
By default, all the filters applied to a view are enabled.
filterElementId:
The ElementId of the filter.
Returns:
True if the specified filter is enabled in this view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Filter is not applied to the view.
-or-
ElementId is not associated with a FilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element "this View" does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2021

Autodesk.Revit.DB.View.SetFilterVisibility(Autodesk.Revit.DB.ElementId,System.Boolean)
Sets the visibility of the elements associated with a filter.
Remarks:
If the filter is not currently applied to the view, this will add the filter with the specified visibility.
filterElementId:
The ElementId of the filter.
visibility:
True if the elements associated with the filter are visible in the view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
ElementId is not associated with a FilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element "this View" does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.GetFilterVisibility(Autodesk.Revit.DB.ElementId)
Gets the visibility of the elements associated with a filter.
filterElementId:
The ElementId of the filter.
Returns:
True if the elements associated with the filter are visible in the view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Filter is not applied to the view.
-or-
ElementId is not associated with a FilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element "this View" does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.RemoveFilter(Autodesk.Revit.DB.ElementId)
Removes a filter from the view.
filterElementId:
ElementId of the filter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Filter is not applied to the view.
-or-
ElementId is not associated with a FilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element "this View" does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.AddFilter(Autodesk.Revit.DB.ElementId)
Adds a filter to the view.
Remarks:
The filter will be added with default overrides, which means that there will be no change in the view's display.
The filter is appended as the last filter in the order of filters applied to this view.
filterElementId:
ElementId of the filter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
ElementId is not associated with a FilterElement.
-or-
Filter is already applied to the view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element "this View" does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.SetFilterOverrides(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.OverrideGraphicSettings)
Sets the overrides associated with a filter.
Remarks:
If the filter is not currently applied to the view, this will add the filter with the assigned overrides.
filterElementId:
ElementId of the filter.
overrideGraphicSettings:
The overrides to apply to the filter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
ElementId is not associated with a FilterElement.
-or-
Fill pattern must be a drafting pattern.
-or-
Fill pattern Id must be invalidElementId or point to a LinePattern element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element "this View" does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.GetFilterOverrides(Autodesk.Revit.DB.ElementId)
Gets graphic overrides that a filter applies to the view.
filterElementId:
ElementId of the filter.
Returns:
Object representing all graphic overrides of the filter in the view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
ElementId is not associated with a FilterElement.
-or-
Filter is not applied to the view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element "this View" does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.GetOrderedFilters
Gets the filters applied to the view in the order they are applied.
Returns:
The ElementIds of the Filters.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element "this View" does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2021

Autodesk.Revit.DB.View.GetFilters
Gets the filters applied to the view.
Remarks:
Note that this method returns filters in a set sorted according to their ids.
To get filters in the order they are applied to the view use Autodesk.Revit.DB.View.GetOrderedFilters.
Returns:
The ElementIds of the Filters.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element "this View" does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.IsCategoryOverridable(Autodesk.Revit.DB.ElementId)
Checks whether the category can have graphic overrides in this view.
Remarks:
Categories can be allowed to be overridden in some view types and prohibited from being overridden in others.
E.g., categories cannot be overridden in Autodesk.Revit.DB.ViewType.ProjectBrowser
categoryId:
ElementId of the category.
Returns:
True if category can be overridden, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.View.GetCategoryOverrides(Autodesk.Revit.DB.ElementId)
Gets graphic overrides for a category in view.
categoryId:
Category to be checked.
Returns:
Object representing all graphic overrides of the category categoryId in view. A default OverrideGraphicSettings object will be returned if it not previously been set for this view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.RemoveLinkOverrides(Autodesk.Revit.DB.ElementId)
Deletes the graphical link overrides in the current view.
Remarks:
If the input linkId references Autodesk.Revit.DB.RevitLinkType, then the link overrides will be set to default.
If the input linkId references Autodesk.Revit.DB.RevitLinkInstance, then the link overrides will be removed and the settings of Autodesk.Revit.DB.RevitLinkType will be used for this instance.
linkId:
The id of the Autodesk.Revit.DB.RevitLinkType or Autodesk.Revit.DB.RevitLinkInstance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input id is not a valid RevitLinkInstance or RevitLinkType id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The view type does not support Visibility/Graphics Overriddes.
-or-
The view does not support link graphical overrides.
Since:
2024

Autodesk.Revit.DB.View.SetLinkOverrides(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.RevitLinkGraphicsSettings)
Sets the graphic overrides of a Autodesk.Revit.DB.RevitLinkType or Autodesk.Revit.DB.RevitLinkInstance in the view.
linkId:
The id of the Autodesk.Revit.DB.RevitLinkType or Autodesk.Revit.DB.RevitLinkInstance.
linkDisplaySettings:
Settings representing all link graphic overrides in the view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input id is not a valid RevitLinkInstance or RevitLinkType id.
-or-
Setting link overrides to type LinkVisibility.Custom is not supported via the API.
-or-
The LinkedViewId of linkDisplaySettings has incorrect value for the specified LinkVisibilityType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The view type does not support Visibility/Graphics Overriddes.
-or-
The view does not support link graphical overrides.
Since:
2024

Autodesk.Revit.DB.View.GetLinkOverrides(Autodesk.Revit.DB.ElementId)
Gets the graphic overrides of a Autodesk.Revit.DB.RevitLinkType or Autodesk.Revit.DB.RevitLinkInstance in view.
linkId:
The id of the Autodesk.Revit.DB.RevitLinkType or Autodesk.Revit.DB.RevitLinkInstance.
Returns:
Settings representing graphic overrides for the input element id in the view, or null if the input id references Autodesk.Revit.DB.RevitLinkInstance and it doesn't have overrides in the view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input id is not a valid RevitLinkInstance or RevitLinkType id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The view type does not support Visibility/Graphics Overriddes.
-or-
The view does not support link graphical overrides.
Since:
2024

Autodesk.Revit.DB.View.SetCategoryOverrides(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.OverrideGraphicSettings)
Sets graphic overrides for a category in view.
categoryId:
Category to be overridden
overrideGraphicSettings:
Object representing all graphic overrides of the category categoryId in view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Category cannot be overridden.
-or-
Fill pattern must be a drafting pattern.
-or-
Fill pattern Id must be invalidElementId or point to a LinePattern element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.GetPlacementOnSheetStatus
Determines if this view placed on a sheet completely or partially.
Remarks:
Some Views can be placed on one or more Sheets completely or partially.
For example, a Schedule divided in segments, and only some of them are placed on Sheets.
Returns:
A value indicating whether and how the View is placed on a Sheet.
Since:
2023

Autodesk.Revit.DB.View.ConvertTemporaryHideIsolateToPermanent
Convert all temporary hidden elements or categories to permanently hidden in view.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element "this View" does not belong to a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
This View is an internal element, such as a component of a
loaded family or a group type.
-or-
The document containing this View is in Group Edit Mode,
Sketch Edit Mode, or Paste Mode, and the element is not a
member of the group, sketch, or clipboard.
-or-
This View is a member of a group or sketch, and the document
is not currently editing the group or sketch.
Since:
2013

Autodesk.Revit.DB.View.GetCategoryHidden(Autodesk.Revit.DB.ElementId)
Checks if elements of the given category are set to be invisible (hidden) in this view.
Remarks:
This checks only if the category is set visible or invisible individually.  Other Revit mechanisms
may also affect the visibility of elements of this category, including:
The category classes settings for
model categories, annotation categories, import categories or analytical model categories.  View filters.  Elements hidden individually in the view.
Thus the return value may not reflect the actual visibility of elements of this category in the view.
categoryId:
The ID of the category.
Returns:
True if the category is invisible (hidden), false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
categoryId does not correspond to a Category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.View.SetCategoryHidden(Autodesk.Revit.DB.ElementId,System.Boolean)
Sets if elements of the given category will be visible in this view.
Remarks:
This affects only if the category is set visible or invisible individually.  Other Revit mechanisms
may also affect the visibility of elements of this category, including:
The category classes settings for
model categories, annotation categories, import categories or analytical model categories.  View filters.  Elements hidden individually in the view.
Thus setting this value may not affect the actual visibility of elements of this category in the view.
categoryId:
The ID of the category.
hide:
True to make elements of this category invisible, false to make them visible.
Throws Autodesk.Revit.Exceptions.ArgumentException:
categoryId does not correspond to a Category.
-or-
Category cannot be hidden.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.View.CanCategoryBeHidden(Autodesk.Revit.DB.ElementId)
Checks whether the category can be hidden in the view.
Remarks:
Categories can be allowed to be hidden in some view types and prohibited from being hidden in others.
E.g., categories cannot be hidden in Autodesk.Revit.DB.ViewType.ProjectBrowser
elementId:
ElementId of the category.
Returns:
True if the category can be hidden, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.View.IsolateCategoriesTemporary(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Set categories to be temporarily isolated in the view.
elementIds:
Ids of categories to be isolated.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Some elements in elementIds do not correspond to a Category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.View.IsolateCategoryTemporary(Autodesk.Revit.DB.ElementId)
Set one category to be temporarily isolated in the view.
elementId:
Id of category to be isolated.
Throws Autodesk.Revit.Exceptions.ArgumentException:
elementId does not correspond to a Category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.View.IsolateElementTemporary(Autodesk.Revit.DB.ElementId)
Set one element to be temporarily isolated in the view.
To isolate a group completely, you must also include all members of all groups and nested groups in your input, therefore you should use the version of this method that accepts multiple element ids as input.
elementId:
Id of element to be isolated.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.View.IsolateElementsTemporary(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Set multiple elements to be temporarily isolated in the view.
To isolate a group completely, you must also include all members of all groups and nested groups in your input.
elementIds:
Ids of elements to be isolated.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.View.HideCategoriesTemporary(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Set multiple categories to be temporarily hidden in the view.
elementIds:
Ids of the categories to be hidden
Throws Autodesk.Revit.Exceptions.ArgumentException:
Some elements in elementIds do not correspond to a Category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.View.HideCategoryTemporary(Autodesk.Revit.DB.ElementId)
Set one category to be temporarily hidden in the view.
elementId:
Id of the category to be hidden
Throws Autodesk.Revit.Exceptions.ArgumentException:
elementId does not correspond to a Category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.View.CanCategoryBeHiddenTemporary(Autodesk.Revit.DB.ElementId)
Check if category can be temporarily hidden in the view.
elementId:
Id of the category to be checked
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.View.HideElementsTemporary(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Set multiple elements to be temporarily hidden in the view.
To hide a group completely, you must also include all members of all groups and nested groups in your input.
elementIdSet:
Ids of the elements to be temporarily hidden.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.View.HideElementTemporary(Autodesk.Revit.DB.ElementId)
Set one element to be temporarily hidden in the view.
To hide a group completely, you must also include all members of all groups and nested groups in your input, therefore you should use the version of this method that accepts multiple element ids as input.
elementId:
The id of the element to be temporarily hidden.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.View.GetTemporaryViewPropertiesId
When Temporary View Properties mode is in progress it provides view id that overrode settings for current view.
Outside Temporary View Properties mode InvalidElementId will be returned.
Remarks:
Returned ElementId might refer to element that was deleted.
It will happen when Temporary View Properties mode was applied basing on template that next was deleted.
Since:
2014

Autodesk.Revit.DB.View.EnableTemporaryViewPropertiesMode(Autodesk.Revit.DB.ElementId)
Turns Temporary View Properties mode on or off. In this mode, any changes made to the view
are temporary and will be discarded once the mode is disabled.
viewTemplateId:
If the id of a view template is provided, Temporary View Properties mode
is turned on and the settings from the template are applied to the view for the duration of the mode.
If the id provided is not that of a template but the id of the view itself,
Temporary View Properties mode is turned on without any changes to the view.
If ElementId.InvalidElementId is provided, Temporary View Properties mode is turned off.
Returns:
Returns true when the view template provided by viewTemplateId was applied and Temporary View Properties was successfully turned on.
Also returns true if ElementId.InvalidElementId was provided as input and Temporary View Properties was successfully turned off.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View cannot use Temporary View Properties mode in current state.
Since:
2014

Autodesk.Revit.DB.View.IsWorksetVisible(Autodesk.Revit.DB.WorksetId)
Indicates whether the workset is visible in this view.
Remarks:
It will take into account whether the workset is opened or closed.
worksetId:
Id of the workset.
Returns:
Whether the workset is visible.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is no workset with this Id in the document associated with this view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.View.SetWorksetVisibility(Autodesk.Revit.DB.WorksetId,Autodesk.Revit.DB.WorksetVisibility)
Sets visibility for a workset in this view.
Remarks:
It works even when the workset is closed. This settings overrules implicit visibility of the workset (for this particular view only).
worksetId:
Id of the workset.
visible:
The visibility of the workset.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is no workset with this Id in the document associated with this view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.View.GetWorksetVisibility(Autodesk.Revit.DB.WorksetId)
Returns the visibility settings of a workset for this particular view.
Remarks:
The settings does not reflect the fact of whether a workset is currently closed or not.
worksetId:
Id of the workset.
Returns:
The visibility of a workset for this particular view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is no workset with this Id in the document associated with this view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.View.IsElementVisibleInTemporaryViewMode(Autodesk.Revit.DB.TemporaryViewMode,Autodesk.Revit.DB.ElementId)
Identifies if the input element is visible for the temporary view mode for this view.
mode:
The temporary view mode.  Only TemporaryHideIsolate and AnalyticalModel modes are supported
by this option.  Other modes will result in an exception.
id:
The element id.
Returns:
True if the element is visible, false if the element is hidden in the view mode.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This view mode is not supported for checking element visibility.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.View.RestoreCalloutParent
Restores callout parent ID to the original view ID if that view is still available.
Remarks:
Nothing is done if the callout already has parent or if the original callout parent is deleted or is not parallel to the callout view.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This view is not a callout.

Autodesk.Revit.DB.View.RemoveCalloutParent
Replaces callout parent ID with InvalidElementId.
Remarks:
Nothing is done if the callout has already no parent.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This view is not a callout.

Autodesk.Revit.DB.View.GetCalloutParentId
Gets ID of the callout parent view.
Returns:
ID of a view in which this callout was created or InvalidElementId if there is no parent.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This view is not a callout.
Since:
2022

Autodesk.Revit.DB.View.GetCropRegionShapeManagerForReferenceCallout(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Returns an object for managing view crop region shape for reference callout.
Remarks:
Reference callout is a view-specific element referencing another view.
It can have its own crop region shape which doesn't affect the referenced view.
doc:
Document to which the callout belongs.
callout:
Element id of reference callout.
Returns:
The crop region shape manager.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.View.GetModelToProjectionTransforms
Gets the transforms from the model space to the view projection space.
Remarks:
Model space is the global 3D coordinate space in which the geometry
of the model lives.
View projection space is the 3D Euclidean space with a coordinate system such that
X and Y are horizontal and vertical directions in the view projection plane and Z
is the cross product of X and Y. Distances in the projection space are the same as
would be measured on paper if the view is printed without additional scaling.
Most views will return just one Autodesk.Revit.DB.TransformWithBoundary.  The exceptions are
views with split crop regions.  Split crop regions can be independently moved and therefore
each region of a split crop gets its own transform and boundary.  You can check if a view has split crop
regions by getting the Autodesk.Revit.DB.ViewCropRegionShapeManager and calling ViewCropRegionShapeManager.IsSplit().
When the view's crop region is split, many TransformWithBoundary objects will be returned.
Each TransformWithBoundary corresponds to one region of the split crop. To determine which
TransformWithBoundary to use when converting a model point into view projection space,
first test to see which split crop region boundary contains the model point.
See TransformWithBoundary.GetBoundary().
Returns:
The transformations from the model space to view projection space.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The view does not return transforms.
-or-
The view is a perspective view.
Since:
2023

Autodesk.Revit.DB.View.HasViewTransforms
Returns true if the view reports model space to view projection space transforms.
Remarks:
Not all views return transforms.  For example, schedules and legends
do not report transforms.
Returns:
True if the view returns transforms, false otherwise.
Since:
2023

Autodesk.Revit.DB.View.ViewTemplateId
The id of the template view that controls this view's parameters.
Remarks:
Parameters controlled by the template cannot be changed directly in this view.
Any change to controlled parameters in the template will cause change of the corresponding parameters in this view.
Use Autodesk.Revit.DB.View.GetTemplateParameterIds on the template view to get a list of all template parameters.
Use Autodesk.Revit.DB.View.GetNonControlledTemplateParameterIds on the template view to get parameters that are not controlled by the template.
The id of the template view that controls this view's parameters. InvalidElementId if there is no template set for this view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: val is not valid as a view template id for this view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.View.DisplayStyle
The DisplayStyle of the view.
Returns DisplayStyle.Wireframe if the view has no display style.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: DisplayStyle cannot be set to Undefined.
-or-
When setting this property: DisplayStyle of Drafting Views can be set only to Wireframe or HLR
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: DisplayStyle cannot be modified.
-or-
When setting this property: This view does not contain display-related properties.
Since:
2013

Autodesk.Revit.DB.View.AnalysisDisplayStyleId
Element id of Analysis Display Style associated with the view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: Cannot set the AnalysisDisplayStyleId for the specified view.
Since:
2011

Autodesk.Revit.DB.View.IsCallout
Indicates if the view is a callout view.
Remarks:
Reference callouts are not treated as callout views.
The view was created as a callout in its parent view but it may show as a section in orthogonal views.
Since:
2022

Autodesk.Revit.DB.View.HideElements(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Sets the elements to be hidden in the view.
elementIdSet: A set of ElementIds to be hidden.
Remarks: This change is permanent until the elements are unhidden.
All elements in the set must be currently unhidden and must be allowed to be hidden.
An application can check this with Autodesk.Revit.DB.Element.IsHidden(Autodesk.Revit.DB.View) and Autodesk.Revit.DB.Element.CanBeHidden(Autodesk.Revit.DB.View).
Some elements cannot be hidden directly. Examples include: group, array, constraint, edit cut profile, face splitter and link to external documents.Also, elements cannot be hidden in Revit family documents (but they can be hidden temporarily using Autodesk.Revit.DB.View.HideElementsTemporary(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})).To hide a group completely, you must also include all members of all groups and nested groups in your input.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when argument is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when the set of elements to be hidden is empty or one of the elements can not be hidden.
Also thrown when the set of elements to be hidden includes the view itself.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when document regeneration failed.